#решено
c = [
    9,8,7,6,5,4,3,2,1,0
]
a = [
    9,8,7,6,5,4,3,2,1,0
]
b = [
    9,8,7,6,5,4,3,2,1,0
]
e = 1000
r = 1000
for z in c:
    for x in a:
        for y in b:
            while e >100:
                e = e - 1
                while r >100:
                    if e * r == z * 100001 + x * 10010 + y * 1100 :
                        print("_______")
                        print(e)
                        print(r)
                        print(e * r)
                    r = r - 1
                r = 1000
            e = 1000
#Ответ
#993*913=906609